# Brewfile
# A list of the developer machine's dependencies from Homebrew
# https://github.com/Homebrew/homebrew-bundle
#
# Usage:
#
#    $ brew bundle
#
# IMPORTANT: Remember to scroll back through the installation
# log so you can read all the caveats. Otherwise, you might
# forget to do things like set up the LaunchAgents.
#

cask_args appdir: '/Applications'

brew 'awscli'
brew 'bash-completion'
brew 'carthage'
brew 'cloc'
brew 'cmake'
brew 'fasd'
brew 'ffmpeg'
brew 'forego'
brew 'git'
brew 'go'
brew 'graphviz'
brew 'hugo'
brew 'icu4c'
brew 'jsonlint'
brew 'mas'
brew 'memcached'
brew 'ncdu'
brew 'nmap'
brew 'openssl'
brew 'postgresql'
brew 'postgresql@10'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ruby-build'
brew 'ssh-copy-id'
brew 'swiftlint'
brew 'terminal-notifier'
brew 'tree'
brew 'wget'
brew 'yamllint'

# Homebrew Cask
# http://caskroom.io
#
# Read https://github.com/Homebrew/homebrew-cask/issues/58046 if you ever see:
# Error: Cask 'wireshark' definition is invalid: invalid 'depends_on macos' value: ">= :mountain_lion"

cask '1password'
cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'bbedit'
cask 'cheatsheet'
cask 'chromedriver'
cask 'coderunner'
cask 'dropbox'
cask 'github'
cask 'google-chrome'
cask 'mindnode-pro'
cask 'psequel'
cask 'sketch'
cask 'textexpander'
cask 'textmate'
cask 'toggl'
cask 'vmware-fusion'
cask 'wireshark'
cask 'xscope'
cask 'tableplus'

# Font Casks
# https://github.com/caskroom/homebrew-fonts

tap 'homebrew/cask-fonts'

cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
